#include <iostream>

using namespace std;

int main()
{   //print list questions to the screen
    cout << "1. Я на майбутній роботі хочу мати справу з документами чи з людьми? (адже це абсолютно різні стилі життя)" << endl;
    cout << "2. Я хочу мати роботу сидячу чи мобільну? (це залежить від характеру)" << endl;
    cout << "3. Я хочу працювати на себе чи на когось? (для багатьох — це важливо)." << endl;
    cout << "4. Мені потрібна робота рутинна чи креативна? (програмування — це переважно креативне заняття)" << endl;
    cout << "5. Я хочу працювати у великій компанії чи в маленькій, в державній компанії чи у приватній?" << endl;
    cout << "6. Я хочу працювати на батьківщині чи за кордоном?" << endl;
    cout << "7. Я хочу керувати чи виконувати?" << endl;
    cout << "8. Я хочу працювати в одній професії чи в різнопланових проектах?" << endl;
    cout << "9. Я хочу багато грошей і готовий(а) до нервово-неспокійне життя, чи не виснажувати себе, а гроші — як вийде ? " << endl;
    cout << "10. Я хочу працювати за фіксованим чи вільним графіком?" << endl;
    cout << "11. Приблизно скільки грошей я хочу отримувати відразу, через 3 роки, через 5 років, через 10 років?" << endl;
    return 0;
}